.config/sway/config.d/input
# [[file:../../../Desktop.org::*Input][Input:1]]
input type:touchpad {
      dwt enabled
      tap enabled
      natural_scroll enabled
}

# Read `man 5 sway-input` for more information about this section.
# - more details in `xkeyboard-config`

input type:keyboard {
      xkb_model "pc105"
      xkb_layout "io"
      xkb_variant "altgr-intl"
      xkb_options "caps:hyper"
      # xkb_options "caps:swapescape"
}

# input type:keyboard xkb_model "pc105"
# Input:1 ends here

# [[file:../../../Desktop.org::*Input][Input:2]]
#exec_always {
#   'swaymsg input type:keyboard xkb_layout "$(localectl status | grep "X11 Layout" | sed -e "s/^.*X11 Layout://")"'
#   'swaymsg input type:keyboard xkb_variant "$(localectl status | grep "X11 Variant" | sed -e "s/^.*X11 Variant://")"'
#}
# Input:2 ends here
